                                             ASSIGNMENT PANDAS - 01

Ques-1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data=[4,8,15,16,23,42]

In [3]:
df = pd.Series(data)

In [4]:
print(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Ques-2.  Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable            print it.

In [5]:
import pandas as pd

my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
my_series = pd.Series(my_list)

print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Ques-3. Create a Pandas DataFrame that contains the following data:

In [6]:
import pandas as pd

In [8]:
data = { 'Name' : ['Alice','Bob','Claire'] ,
         'Age' : ['25','30','27' ],
         'Gender' : ['Female','Male','Female'] }

In [9]:
df = pd.DataFrame(data)

In [10]:
df

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

Ques-4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional, tabular data structure that consists of rows and columns, similar to a spreadsheet or SQL table. It can be thought of as a collection of Pandas Series where each column is a Series. DataFrames are versatile and provide a wide range of functionalities for data manipulation, analysis, and exploration.
            On the other hand, a Pandas Series is a one-dimensional labeled array capable of holding any data type. It is like a single column of data in a DataFrame. A DataFrame is essentially a collection of Series that share the same index.

In [11]:
import pandas as pd

# Creating a Series
series_data = pd.Series([1, 2, 3, 4], name='MySeries')

# Creating a DataFrame
data = {'Column1': [1, 2, 3, 4],
        'Column2': ['A', 'B', 'C', 'D']}
df = pd.DataFrame(data)

# Printing the Series and DataFrame
print("Pandas Series:")
print(series_data)
print("\nDataFrame:")
print(df)

Pandas Series:
0    1
1    2
2    3
3    4
Name: MySeries, dtype: int64

DataFrame:
   Column1 Column2
0        1       A
1        2       B
2        3       C
3        4       D

Ques-5.  What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of          when you might use one of these functions?

head() and tail(),info(),describe(),drop(),groupby(),merge(),sort_values(),loc[] and iloc[]

In [12]:
import pandas as pd

In [13]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [15]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [16]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [19]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Ques-6.  Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, the Series and DataFrame are mutable, while the Panel is considered deprecated as of version 0.25.0 and is not recommended for use. Therefore, it's recommended to focus on using Series and DataFrame for one-dimensional and two-dimensional data structures, respectively.
          Mutable means that the object can be modified or altered after its creation. Both Series and DataFrame can have their values, indices, and columns changed after creation.

In [25]:
import pandas as pd

# Creating a DataFrame
data = {'Column1': [1, 2, 3, 4],
        'Column2': ['A', 'B', 'C', 'D']}
df = pd.DataFrame(data)

# Modify a value in the DataFrame
df.at[2, 'Column1'] = 99

In [26]:
df

   Column1 Column2
0        1       A
1        2       B
2       99       C
3        4       D

Ques-7.  Create a DataFrame using multiple Series. Explain with an example

In [27]:
import pandas as pd

# Creating multiple Pandas Series
series1 = pd.Series([1, 2, 3, 4], name='Column1')
series2 = pd.Series(['A', 'B', 'C', 'D'], name='Column2')
series3 = pd.Series([10.5, 20.2, 15.8, 8.9], name='Column3')

# Combining the Series into a dictionary
data = {'Column1': series1, 'Column2': series2, 'Column3': series3}

# Creating a DataFrame using the dictionary
df = pd.DataFrame(data)

# Printing the resulting DataFrame
print(df)

   Column1 Column2  Column3
0        1       A     10.5
1        2       B     20.2
2        3       C     15.8
3        4       D      8.9